# Shell
brew "zsh"

# Version control
brew "git"

# Python development
brew "pyenv"
brew "pipenv"

# Ruby development
brew "rbenv"

# JavaScript development
brew "nvm"
brew "yarn"

# Editors
brew "vim"
brew "tmux"
cask "visual-studio-code"

# Secrets management
mas "1Password 7", id: 1333542190

# Infrastructure
cask "docker"
brew "terraform"
tap "heroku/brew"
brew "heroku/brew/heroku"

# Dynamic documents
cask "mactex"
brew "pandoc"
